//? clearInterval(intervalId) є методом в JS, він використовується для зупинки інтервалу,
//?  який був встановлений раніше за допомогою setInterval().

//* Коли викликаємо setInterval(), він створює інтервал, який виконує задану ф-цію через інтервал часу.
//* setInterval() повертає унікальний ідентифікатор (часто називається "ID інтервалу"), який використовується для ідентифікації цього інтервалу.

//* Щоб зупинити інтервал, можна викликати clearInterval() і передати йому цей унікальний ідентифікатор (intervalId), який був повернутий setInterval().
//* Коли викликається clearInterval(intervalId), JS знає, який інтервал зупинити.

//* Отже, при виконанні clearInterval(intervalId) інтервал зупиняється, і ф-ція, яка була передана в setInterval(), перестає виконуватися

// Наприклад:

// Встановлюємо інтервал, який змінює фоновий колір кожну секунду
const intervalId = setInterval(() => {
  document.body.style.backgroundColor = getRandomHexColor();
}, 1000);

// Зупиняємо інтервал після 5 секунд
setTimeout(() => {
  clearInterval(intervalId); // Зупиняємо інтервал, передаючи йому intervalId
}, 5000);
